//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
//**********************************************************************
//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
//
//**********************************************************************

//<AMI_FHDR_START>
//---------------------------------------------------------------------------
// Name:		AMTTseFunc.nui
//
// Description:	AMT TSE Strings file.
//
//---------------------------------------------------------------------------
//<AMI_FHDR_END>
/=#
#include "VFR.uni"

#string STR_AMT_FORM				#language eng "AMT Configuration"
#string STR_AMT_FORM_HELP			#language eng "Configure Active Management Technology Parameters"

#string STR_AMT_SUBTITLE        	#language eng "Active Management Technology Configuration"

//---------------------------------------------------------------------------
// AMT Configuration
//---------------------------------------------------------------------------
#string STR_AMT_PROMPT              #language eng  "Intel AMT"
#string STR_AMT_HELP                #language eng  "Enable/Disable Intel (R) Active Management Technology BIOS Extension. \nNote : iAMT H/W is always enabled. \nThis option just controls the BIOS extension execution. \nIf enabled, this requires additional firmware in the SPI device"
#string STR_AMTBX_SETUP_PROMPT      #language eng  "Intel AMT Setup Prompt"
#string STR_AMTBX_SETUP_HELP        #language eng  "OEMFLag Bit 0:\nEnable/Disable Intel AMT Setup Prompt to wait for hot-key to enter setup."

#string STR_AMTBX_HOTKEY_PRESSED_PROMPT    #language eng  "BIOS Hotkey Pressed"
#string STR_AMTBX_HOTKEY_PRESSED_HELP	     #language eng  "OEMFLag Bit 1:\nEnable/Disable BIOS hotkey press."

#string STR_AMTBX_SELECTION_SCREEN_PROMPT    #language eng  "MEBx Selection Screen"
#string STR_AMTBX_SELECTION_SCREEN_HELP	     #language eng  "OEMFLag Bit 2:\nEnable/Disable MEBx selection screen."

#string STR_AMT_VERBOSE_OUTPUT_PROMPT  #language eng  "Verbose Mebx Output"
#string STR_AMT_VERBOSE_OUTPUT_HELP    #language eng  "OEMFlag Bit 3:\nEnable/Disable Verbose Mebx Output.\n"

#string STR_AMT_HIDE_CONFIRMATION_UNCONFIGURE_ME_PROMPT #language eng  "Hide Un-Configure ME Confirmation Prompt"
#string STR_AMT_HIDE_CONFIRMATION_UNCONFIGURE_ME_HELP   #language eng  "OEMFlag Bit 6:\nHide Un-Configure ME without password Confirmation Prompt "

#string STR_AMT_MEBX_DEBUG_MSG_PROMPT #language eng  "MEBx Debug Message Output"
#string STR_AMT_MEBX_DEBUG_MSG_HELP   #language eng  "OEMFlag Bit 14:\nEnable MEBx debug message output."

#string STR_AMT_UNCONFIGURE_ME_PROMPT #language eng  "Un-Configure ME"
#string STR_AMT_UNCONFIGURE_ME_HELP   #language eng  "OEMFlag Bit 15:\nUn-Configure ME without password."

#string STR_AMT_SPI_LOCK_PROMPT     #language eng  "Intel AMT SPI Protected"
#string STR_AMT_SPI_LOCK_HELP       #language eng  "Enable/Disable Intel AMT SPI write protect."

#string STR_SET_ME_DISABLED_PROMPT  #language eng  "Disable ME"
#string STR_SET_ME_DISABLED_HELP    #language eng  "Set ME to Soft Temporary Disabled."
#string STR_YES                     #language eng  "YES"
#string STR_NO                      #language eng  "NO"

#string STR_AMT_PASSWORD_PROMPT     #language eng  "Intel AMT Password Write Enabled"
#string STR_AMT_PASSWORD_HELP       #language eng  "Enable/Disable Intel AMT Password Write. Password is writeable when set Enable"
#string STR_HECI_TIMEOUT_PROMPT     #language eng  "HECI Timeout"
#string STR_HECI_TIMEOUT_HELP       #language eng  "Enable/Disable HECI Timeout for Send/Read Message and Wait for Initialization."
#string STR_AMT_WAIT_TIMER_PROMPT   #language eng  "Amt Wait Timer"
#string STR_AMT_WAIT_TIMER_HELP     #language eng  "Set timer to wait before sending ASF_GET_BOOT_OPTIONS."
#string STR_AMTIDER_PROMPT          #language eng  "AMT IDE-R"
#string STR_AMTIDER_HELP            #language eng  "Enable/Disable boot from LAN."
#string STR_ENABLED		    #language eng "Enabled"
#string STR_DISABLED		    #language eng "Disabled"

#string STR_AMT_CIRA_REQUEST_PROMPT #language eng  "Activate Remote Assistance Process"
#string STR_AMT_CIRA_REQUEST_HELP   #language eng  "Trigger CIRA boot."

#string STR_AMT_CIRA_TIMEOUT_PROMPT #language eng  "AMT CIRA Timeout"
#string STR_AMT_CIRA_TIMEOUT_HELP   #language eng  "OEM defined timeout for MPS connection to be established.\n  0 - use the default timeout value of 60 seconds. \n  255 - MEBX waits until the connection succeeds"

#string STR_AMT_USB_CONFIGURE_PROMPT #language eng  "USB Configure"
#string STR_AMT_USB_CONFIGURE_HELP   #language eng  "Enable/Disable USB Configure function."

#string STR_AMT_PET_PROGRESS_PROMPT #language eng  "PET Progress"
#string STR_AMT_PET_PROGRESS_HELP   #language eng  "User can Enable/Disable PET Events progress to recieve PET events or not."
//---------------------------------------------------------------------------
// ASF Configuration
//---------------------------------------------------------------------------

#string STR_ASF_PROMPT              #language eng  "ASF"
#string STR_ASF_HELP                #language eng  "Enable/Disable Alert Specification Format."

#string STR_WATCHDOG_PROMPT         #language eng  "WatchDog"
#string STR_WATCHDOG_HELP           #language eng  "Enable/Disable WatchDog Timer."

#string STR_WATCHDOG_TIMER_OS_PROMPT #language eng  " OS Timer"
#string STR_WATCHDOG_TIMER_OS_HELP   #language eng  "Set OS watchdog timer."

#string STR_WATCHDOG_TIMER_BIOS_PROMPT #language eng  " BIOS Timer"
#string STR_WATCHDOG_TIMER_BIOS_HELP   #language eng  "Set BIOS watchdog timer."
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************